<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Checks for the update of a MAS app. If the version on disk is up to date, then upload it to munkiserver. If out of date, abort. This recipe MUST ONLY be used with an override - do not run this recipe directly. See the documentation here:
      https://github.com/autopkg/nmcspadden-recipes/#appstoreapp-recipe</string>
    <key>Identifier</key>
    <string>com.github.ohiouniversityscripps.munkiserver.appstore</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>AppStoreApp</string>
      <key>PATH</key>
      <string>/Users/Shared/Jenkins/Remote_Apps/%NAME%.app</string>
      <key>DESTINATION_PATH</key>
      <string>/Applications</string>
      <key>pkginfo</key>
      <dict>
        <key>display_name</key>
        <string>%NAME%</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.nmcspadden.check.appstore</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>StopProcessingIf</string>
        <key>Arguments</key>
        <dict>
          <key>predicate</key>
          <string>update_available == YES</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PkgBuildTester</string>
        <key>comment</key>
        <string>Look in our recipe cache for an existing, current package.</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_build_name</key>
          <string>%NAME%</string>
          <key>pkg_dir</key>
          <string>%RECIPE_CACHE_DIR%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>StopProcessingIf</string>
        <key>comment</key>
        <string>If a package has already been built with this version and ID (and "force_pkg_build" is False), we're done.</string>
        <key>Arguments</key>
        <dict>
          <key>predicate</key>
          <string>pkg_build_matches == YES</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Copier</string>
        <key>Arguments</key>
        <dict>
          <key>source_path</key>
          <string>%PATH%</string>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%/%PATH%</string>
          <key>overwrite</key>
          <true/>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>DmgCreator</string>
        <key>Arguments</key>
        <dict>
          <key>dmg_root</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%/%PATH%</string>
          <key>dmg_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>MunkiInstallsItemsCreator</string>
        <key>Arguments</key>
        <dict>
          <key>faux_root</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%</string>
          <key>installs_item_paths</key>
          <array>
            <string>%DESTINATION_PATH%</string>
          </array>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>MunkiPkginfoMerger</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>MunkiServerUploader</string>
        <key>Arguments</key>
        <dict>
          <key>package_file</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
          <key>pkginfo_destinationpath</key>
          <string>%DESTINATION_PATH%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PathDeleter</string>
        <key>Arguments</key>
        <dict>
          <key>path_list</key>
          <array>
            <string>%RECIPE_CACHE_DIR%</string>
          </array>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
