<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the current installation package for FileZilla and uploads it to munkiserver.</string>
		<key>Identifier</key>
		<string>com.github.ohiouniversityscripps.recipes.munkiserver.FileZilla</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/FileZilla</string>
			<key>NAME</key>
			<string>FileZilla</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>description</key>
				<string>FileZilla is a fast and reliable cross-platform FTP, FTPS and SFTP client.</string>
				<key>display_name</key>
				<string>FileZilla</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>ParentRecipe</key>
		<string>com.github.keeleysam.recipes.FileZilla.download</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%pathname%</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>purge_destination</key>
					<true/>
				</dict>
				<key>Processor</key>
				<string>Unarchiver</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>dmg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
					<key>dmg_root</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				</dict>
				<key>Processor</key>
				<string>DmgCreator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>package_file</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				</dict>
				<key>Processor</key>
				<string>MunkiServerUploader</string>
			</dict>
		</array>
	</dict>
</plist>
